yii3/advanced/frontend/models/House.php

    public function upda($data,$where)
    {
        $res = $this->updateAll($data,$where);
---
UPDATE `house` SET `is_delete`=1 WHERE `house_id`='7,8'