yii3/advanced/frontend/controllers/CartController.php

    public  function  actionShow(){
           $query = new Query();
           $list = $query->from("cart")->where("is_delete=0")->all();
            // var_dump($list);die;
            $pages = new Pagination([
            'totalCount' =>count($list),
            'pageSize' =>3,//pageSize 每页显示的条数
            ]);
            $data = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `cart` WHERE is_delete=0
SELECT * FROM `cart` WHERE is_delete=0 LIMIT 3