yii3/advanced/frontend/controllers/HouseController.php

SELECT * FROM `house` WHERE `is_delete`=0
SELECT * FROM `house` WHERE `is_delete`=0 LIMIT 2
---
    public function actionShow()
    {
        //实例化查询类
        $query = new Query();
        //查询出所有的数据
        $houseList = $query->from('house')->where(['is_delete'=>0])->all();
        //统计数据个数
        $count = count($houseList);
        //实例化分页类
        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->setPageSize(2 );
        $data = $query->offset($pagination->offset)->limit($pagination->limit)->all();