yii3/advanced/frontend/controllers/LoginController.php

    public function actionLogin(){
        $request=Yii::$app->request->post();
        if($request){
            $username=Yii::$app->request->post('user_name');
            $pwd=Yii::$app->request->post('user_pwd');
            //var_dump($username);
            $query=new Query();
            $arr=$query->select('*')->from('user')->where("user_name='$username'")->one();
---
SELECT * FROM `user` WHERE user_name='admin'