yii3/advanced/frontend/controllers/NodeController.php

SELECT * FROM `node`
---
    public function actionShow(){
        $query = new Query();
        //查询出所有的数据
        $nodeList = $query->from('node')->all();

SELECT * FROM `node`
---
    public function actionAdd(){
        $query = new Query();
        //查询出所有的数据
        $nodeList = $query->from('node')->all();