yii3/advanced/frontend/controllers/UsersController.php

    public function actionShow(){
        $query = new Query();
        //查询出所有的数据
        $userList = $query->from('user')->where(['is_delete'=>0])->all();
        //统计数据个数
        $count = count($userList);
        //实例化分页类
        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->setPageSize(2 );
        $data = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT * FROM `user` WHERE `is_delete`=0
SELECT * FROM `user` WHERE `is_delete`=0 LIMIT 2